articles/makestuff.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lose 100 Games</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Lose 100 Games</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org78ee54b">Lose As Much As Possible</a>
<ul>
<li><a href="#org7a24628">Go Proverbs</a>
<ul>
<li><a href="#org37fdb72">Lose Your First 50 Games as Quickly as Possible</a></li>
<li><a href="#orgd410883">Only after the 10th punch will you see the fist</a></li>
</ul>
</li>
<li><a href="#org4703e69">90th Percentile Crosses a Graveyard of Quitters</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org78ee54b" class="outline-1">
<h1 id="org78ee54b">Lose As Much As Possible</h1>
<div class="outline-text-1" id="text-org78ee54b">
<p>
There's a commonly referenced "law" called <a href="https://en.wikipedia.org/wiki/Sturgeon%27s_law">Sturgeon's Law</a> which says "90% of everything is crap".
</p>

<p>
There is a great temptation to see the existence of a law which says that almost everything in the world is garbage and to conclude "I need to be different, I need to never make any garbage, ever". Making something despite a base rate 9:1 odds that your thing will be garbage is <a href="https://planetbanatt.net/articles/coolness.html">an act of bravery</a>. There is an unfortunate consequence of sturgeon's law which never gets mentioned: your thing will probably be garbage, and that is perfectly fine.
</p>
</div>

<div id="outline-container-org7a24628" class="outline-2">
<h2 id="org7a24628">Go Proverbs</h2>
<div class="outline-text-2" id="text-org7a24628">
<p>
There was a time period where I, like many anime watching competitive games guys, watched <i>Hikaru no Go</i> and then briefly played a bunch of <a href="https://en.wikipedia.org/wiki/Go_(game)">Go</a>. Like most of these people I did not end up sticking with it, but I did spend a lot of time <i>reading</i> about the world of professional Go, a game with many thousands of years of history behind it<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>

<p>
Given that the game was invented in China many years ago, it's somewhat unsurprising that the game has it's own little corpus of <a href="https://en.wikipedia.org/wiki/Chengyu">Chengyu</a>, commonly called set phrasees, chinese idioms, or <i>proverbs</i>. These are <a href="https://senseis.xmp.net/?Proverb">pithy little phrases</a> that are esay to remember, and equivalents of these exist in english for <a href="https://en.wikipedia.org/wiki/Bruce_Pandolfini#%22Pandolfinisms%22">other board games</a> as well. 
</p>

<p>
There are two proverbs which have stuck with me well past my brief fascination with Go.
</p>
</div>

<div id="outline-container-org37fdb72" class="outline-3">
<h3 id="org37fdb72">Lose Your First 50 Games as Quickly as Possible</h3>
<div class="outline-text-3" id="text-org37fdb72">
<p>
We live in a world of expected permanent success. Incentive structures for most children (and most adults) encourages people to adopt lifestyles where they see only the minimum possible probability of failure, with only the minimum possible stakes. Bright students are expected to succeed in all of their classes. Useful workers are expected to consistently deliver value. Failure is never an option.
</p>

<p>
Generally speaking this is all frightfully boring. It's a much better use of time to be <a href="https://planetbanatt.net/articles/leetcode.html">as uncomfortable as possible</a>, compared to only ever taking on challenges which are trivially possible for you.
</p>

<p>
This go proverb is memorable because not only does it tell you to not expect to win games, it specifically tells you that losing lots of games quickly is <i>a win condition</i>. In a lost game, there's always some distance between your performance and what you needed to cross in order to win; in a won game, there's always a temptation to say "I just need to do that, just like that, every time". It is much harder to motivate yourself to care about <i>winning</i> a game <i>even harder</i> than you already did<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
</div>
</div>

<div id="outline-container-orgd410883" class="outline-3">
<h3 id="orgd410883">Only after the 10th punch will you see the fist</h3>
<div class="outline-text-3" id="text-orgd410883">
<p>
The <a href="https://senseis.xmp.net/?OnlyAfterThe10thPunchWillYouSeeTheFist">long form</a> of this concludes "and only after the 20th will you block it". This is kind of like the above point, but on the scale of individual games. Go is very interesting in the space of board games because the games are won and lost over extremely long time horizons, meaning you win by winning a great many smaller battles compared to Chess where often one decisive confrontation will end the game<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. For example, you can see strong players sometimes play <a href="https://senseis.xmp.net/?TeachingGame">teaching games</a> with weaker players, where the intent isn't to crush the player but to instead present a number of "tests" to the student, and giving them multiple attempts to eventually arrive at a conclusion.
</p>

<p>
The takeaway from this proverb is that it will often take you a lot of exposure to even become aware of common patterns that repeatedly foil you, to say nothing of patterns you are seeing for the first time. Even on a local move-by-move level, you will repeatedly fail until you actually notice what is happening, and then you will <i>still</i> continue to fail until you come up with a satisfactory solution to that thing you just noticed.
</p>
</div>
</div>
</div>

<div id="outline-container-org4703e69" class="outline-2">
<h2 id="org4703e69">90th Percentile Crosses a Graveyard of Quitters</h2>
<div class="outline-text-2" id="text-org4703e69">
<p>
Simulate things
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
At one point I do think I'll go back and revisit this, since I did find it to be great fun, it was just a bit too intense of a time investment relative to other things I was already working on.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This could even look really weird in practice &#x2013; Alphago famously deteriorated it's own advantage in the tail end of games seemingly to drive down uncertainty, since it saw equal reward for a 0.5 stone win compared to a 10 stone win. 
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This maybe is an oversimplification here but the idea I'm hinting at is that "a tactic" in chess will confer you material advantage that a strong player could use to win the game immediately, and "a tactic" in go will win a fractionally higher probability of victory.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
